[
    {
        "city": "Seoul",
        "country": "South Korea",
        "company": "Slexn Inc.",
        "from": "11 / 2017",
        "until": "Now",
        "tasks": [
            {
                "text": "Customized the webapp, desktop app, and mobile apps of an enterprise chat application for usage in Samsung Electronics.",
                "link": null
            },
            {
                "text": "Developed integrations between a variety of tools, including GitHub, Mattermost, codeBeamer, Jira, and others.",
                "link": null
            },
            {
                "text": "Set up CI/CD Pipelines that automatically rebase customized clients onto the upstream master, and developed a chatbot to alert the development team of failed rebase attempts.",
                "link": null
            },
            {
                "text": "Customized a push notification proxy server to meet security requirements set by Samsung Electronics.",
                "link": null
            },
            {
                "text": "Developed data shippers for a logging platform (Humio), and created a dashboard utilizing Humio's querying language.",
                "link": null
            }
        ],
        "skills": [
            "reactjs",
            "nodejs",
            "sql",
            "golang",
            "docker",
            "cicd"
        ]
    },
    {
       "city": "Seoul",
       "country": "South Korea",
       "company": "MAYN Ltd.",
       "from": "06 / 2015",
       "until": "10 / 2017",
       "tasks": [
            {
                "text": "Developed the front-end for the company's core product (Disaster Recovery Automation Solution) utilizing React.js and Redux.",
                "link": null
            },
            {
                "text": "Developed a custom dashboard application for the Korea Local Information Research & Development Institute.",
                "link": null
            },
            {
                "text": "Assisted with the created of back-end features in Java, as well as the creation of SQL queries for CRUD actions.",
                "link": null
            },
            {
                "text": "Maintained and improved the back-end logic of a webapp for project management built over the Spring Framework (Java), and oversaw its implementation in the client-site (the Cloud Data Center of the Metropolitan City of Seoul)",
                "link": null
            }
       ],
       "skills": [
           "reactjs",
           "sql",
           "html",
           "css",
           "jquery"
       ]
    },
    {
        "city": "Seoul",
        "country": "South Korea",
        "company": "Open Source & Misc Projects",
        "from": "04 / 2017",
        "until": "Now",
        "tasks": [
            {
                "text": "Received MVP award from Mattermost Inc. for the creation of a Mattermost Themes site in November 2019.",
                "link": "https://developers.mattermost.com/contribute/mvp/"
            },
            {
                "text": "Made contributions to multiple Mattermost projects, such as the mobile app, webapp, and writing official documentation.",
                "link": null
            },
            {
                "text": "Created a Virtual Reality keyboard meant for WebVR experiences.",
                "link": "https://github.com/WandererOU/aframe-keyboard"
            },
            {
                "text": "Working on an open-source WebVR sandbox with pre-made functionalities that could be re-applied to other projects.",
                "link": "https://labs.wanderer.studio"
            },
            {
                "text": "Working on a mobile application that helps pet owners provide care, and share pet care related information with others",
                "link": null
            }
        ],
        "skills": [
            "reactnative",
            "reactjs",
            "serverlessFramework",
            "flutter"
        ]
    }
]